In [19]:
import pandas as pd
import numpy as np
import datetime as dt
import re
import time
import mysql.connector as mysql
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

## Validating Modules

###  Transform, Load, and Delete Applicants Data

In [12]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [7]:
import etl_transform as transform
from etl_mysql_queries import MySQL_Queries
from db_credential import *

In [3]:
new_column_names = {2:'name',
 3:'email',
 4:'student_id',
6: 'address',
 7:'neighborhood',
 8:'city',
 9:'phone_number',
 10:'current_status',
 21:'internet_access',
 13:'highschool',
 14:'secoundary_school',
 15:'race',
 16:'father_education',
 17:'mother_education',
 18:'tutelary_ecucation',
 19:'avg_income_percapita',
 22:'father_occuparion',
 23:'mother_occupation',
 24:'personal_occupation',
 25:'matao_residence',
 26:'who_living_with_you',
 28:'age',
 30:'vehicle',
 31:'marital_status',
 32:'books',
 33:'books_type',
 34:'movie_theather',
 35:'museum',
 36:'additional_courses',
 58:'career',
 66:'study_room',
 67:'computers',
 68:'smartphones',
 69:'parents_conversation'}
app_df = transform.transfrom_applicants_table("Inscrição Vestibulinho GPE 2022 (respostas).xlsx",22, new_column_names)
app_df.head()

,student_code,name,email,student_id,address,neighborhood,city,phone_number,current_status,internet_access,...,books,books_type,movie_theather,museum,additional_courses,career,study_room,computers,smartphones,parents_conversation
0,100022,AHRON ROGERIO CANOSSA,izzymarques03@gmail.com,398382384,Av Arminio de Arruda Camargo 858,Nova Matão,Matão,(16)997967077,"Sim, concordo com as informações apresentadas ...","Sim, APENAS via internet fixa/banda larga (por...",...,1 a 2,"Revistas de divulgação científica, tecnológica...",Menos que 1 vez por mês,Vou 1 vez por ano,Curso de língua estrangeira - Inglês,Profissão ligada às Artes,1,2,2,Conversam sobre assuntos políticos ou sociais ...
1,100122,ALESSANDRA BIANCA MASSELLI,alessandramasselli427@gmail.com,637620240,Av jacyro rosa,Nova cidade,Matão,16996197764,"Sim, concordo com as informações apresentadas ...","Sim, APENAS via internet fixa/banda larga (por...",...,Mais do que 4,"Livros de ficção (romances, contos, poesias)",Menos que 1 vez por mês,Conheço ou visitei museus apenas por excursões...,Curso preparatório para o vestibular (cursinho),Ainda não escolhi,1,1,2,Almoçam ou jantam com você
2,100222,ALISSON SCARPINATTI LEME,alissonaleme@gmail.com,591952944,Rua Catharina Barleta Moris,Monte Carlo,Matão,16994000680,"Sim, concordo com as informações apresentadas ...","Sim, APENAS via internet fixa/banda larga (por...",...,Mais do que 4,"Revistas sobre educação e estudos (Educação, G...",1 a 2 vezes por mês,Conheço ou visitei museus apenas por excursões...,Curso de língua estrangeira - Espanhol,Não vou seguir nenhuma profissão,1,1,3 ou mais,"Apoiam a escolha de fazer um cursinho, Convers..."
3,100322,ANA BEATRIZ VIEIRA,av996300897@gmail.com,624600713,Antônio Brocheto,Cohab Santa Rosa,Matão,16996300897,"Sim, concordo com as informações apresentadas ...","Sim, APENAS via internet fixa/banda larga (por...",...,1 a 2,"Revistas de informação geral (Carta Capital, V...",Menos que 1 vez por mês,Não tenho esse costume,"Curso de língua estrangeira - Inglês, Curso de...",Profissão ligada às Ciências Biológicas e da S...,1,Nenhum,3 ou mais,Conversam sobre assuntos políticos ou sociais ...
4,100422,ANA CLARA FARIA KAWAHARA,anaclarakawahara5@gmail.com,62370402,Rua José Vieira Priosti 149,Vila Jandira,Matão,16996162944,"Sim, concordo com as informações apresentadas ...","Sim, por pacote de dados E internet fixa/banda...",...,3 a 4,"Livros de ficção (romances, contos, poesias)",Menos que 1 vez por mês,Conheço ou visitei museus apenas por excursões...,Curso preparatório para o vestibular (cursinho),Profissão ligada às Ciências Biológicas e da S...,1,1,3 ou mais,"Conversam sobre livros, filmes ou programas de..."

In [4]:
#Assign Class object
applicants = MySQL_Queries(db_connection =mysql_db_config, table_name = "Applicants")

In [23]:
#Load
applicants.insert_data(app_df)

The query of insert values into the Applicants Table was successfully executed

In [22]:
#Delete
applicants.drop_data(condition = {'student_code':tuple(app_df.student_code)})

The query of dropping values from the Applicants Table was successfully executed

###  Transform, Load, and Delete Students Data

In [11]:
std_df = transform.transform_students_table("resultado_vest2022.xlsx")
std_df.head()

   student_code     NSE  start_date end_date volunteer_id
0        105522  0.3575  2022-03-01     None         None
1        109722  0.3575  2022-03-01     None         None
2        106222  0.4825  2022-03-01     None         None
3        111722  0.2075  2022-03-01     None         None
4        108422  0.7225  2022-03-01     None         None

In [12]:
#Assign Class object
students = MySQL_Queries(db_connection =mysql_db_config, table_name = "Students")

In [24]:
#Load
students.insert_data(std_df)

The query of insert values into the Students Table was successfully executed

In [21]:
#Delete
students.drop_data(condition = {'student_code':tuple(std_df.student_code)}) #tuple(std_df.student_code)

The query of dropping values from the Students Table was successfully executed

### Transform, Load, and Delete Exams Data

In [8]:
ex_df = transform.transform_exams_table(file_name = "Correção_Simul1_2022 .xlsx", answer_key= "GABARITO SIM 1 2022.txt", exame_number=2)
ex_df.head()

subjects,student_code,exame_number,geography,biology,chemistry,history,math,physics,portuguese,literature,english,interdisciplinary
15,100022,2,0.9,0.7,0.4,0.3,0.6,0.1,0.750,0.875,0.8,0.6667
12,100222,2,0.4,0.3,0.2,0.5,0.5,0.3,0.875,0.250,0.2,0.3333
26,100522,2,0.4,0.2,0.4,0.5,0.3,0.0,0.500,0.750,0.6,0.4444
5,101022,2,0.5,0.3,0.3,0.5,0.1,0.3,0.500,0.375,0.2,0.4444
34,101422,2,0.8,0.2,0.2,0.3,0.5,0.2,0.750,0.500,0.2,0.3333

In [9]:
#Assign Class object
exams = MySQL_Queries(db_connection =mysql_db_config, table_name = "Exams")

In [15]:
#Load
exams.insert_data(ex_df.iloc[[13,12,26,34],:])

The query of inserting values into the Exams Table was successfully executed

In [14]:
#Delete
exams.drop_data(condition = {'student_code':tuple(ex_df.student_code)})

The query of dropping values from the Exams Table was successfully executed